e-yes/nuttx/arch/risc-v/src/bl702/hardware/bl702_rf.h
#define BL702_RF_REV                  (BL702_RF_BASE + BL702_RF_REV_OFFSET)
#define BL702_RF_FSM_CTRL_HW          (BL702_RF_BASE + BL702_RF_FSM_CTRL_HW_OFFSET)
#define BL702_RF_FSM_CTRL_SW          (BL702_RF_BASE + BL702_RF_FSM_CTRL_SW_OFFSET)
#define BL702_RFCTRL_HW_EN            (BL702_RF_BASE + BL702_RFCTRL_HW_EN_OFFSET)
#define BL702_RF_TEMP_COMP            (BL702_RF_BASE + BL702_RF_TEMP_COMP_OFFSET)
#define BL702_RFCAL_STATUS            (BL702_RF_BASE + BL702_RFCAL_STATUS_OFFSET)
#define BL702_RFCAL_STATUS2           (BL702_RF_BASE + BL702_RFCAL_STATUS2_OFFSET)
#define BL702_RFCAL_CTRLEN            (BL702_RF_BASE + BL702_RFCAL_CTRLEN_OFFSET)
#define BL702_RFCAL_STATEEN           (BL702_RF_BASE + BL702_RFCAL_STATEEN_OFFSET)
#define BL702_RF_SARADC_RESV          (BL702_RF_BASE + BL702_RF_SARADC_RESV_OFFSET)
#define BL702_RF_BASE_CTRL1           (BL702_RF_BASE + BL702_RF_BASE_CTRL1_OFFSET)
#define BL702_RF_BASE_CTRL2           (BL702_RF_BASE + BL702_RF_BASE_CTRL2_OFFSET)
#define BL702_RF_PUCR1                (BL702_RF_BASE + BL702_RF_PUCR1_OFFSET)
#define BL702_RF_PUCR1_HW             (BL702_RF_BASE + BL702_RF_PUCR1_HW_OFFSET)
#define BL702_RF_PUCR2                (BL702_RF_BASE + BL702_RF_PUCR2_OFFSET)
#define BL702_RF_PUCR2_HW             (BL702_RF_BASE + BL702_RF_PUCR2_HW_OFFSET)
#define BL702_RF_PPU_CTRL_HW          (BL702_RF_BASE + BL702_RF_PPU_CTRL_HW_OFFSET)
#define BL702_RF_PUD_CTRL_HW          (BL702_RF_BASE + BL702_RF_PUD_CTRL_HW_OFFSET)
#define BL702_RF_TRX_GAIN1            (BL702_RF_BASE + BL702_RF_TRX_GAIN1_OFFSET)
#define BL702_RF_TRX_GAIN_HW          (BL702_RF_BASE + BL702_RF_TRX_GAIN_HW_OFFSET)
#define BL702_RF_TEN_DC               (BL702_RF_BASE + BL702_RF_TEN_DC_OFFSET)
#define BL702_RF_TEN_DIG              (BL702_RF_BASE + BL702_RF_TEN_DIG_OFFSET)
#define BL702_RF_TEN_AC               (BL702_RF_BASE + BL702_RF_TEN_AC_OFFSET)
#define BL702_RF_PMIP_MV2AON          (BL702_RF_BASE + BL702_RF_PMIP_MV2AON_OFFSET)
#define BL702_RF_CIP                  (BL702_RF_BASE + BL702_RF_CIP_OFFSET)
#define BL702_RF_PA1                  (BL702_RF_BASE + BL702_RF_PA1_OFFSET)
#define BL702_RF_PA2                  (BL702_RF_BASE + BL702_RF_PA2_OFFSET)
#define BL702_RF_TMX                  (BL702_RF_BASE + BL702_RF_TMX_OFFSET)
#define BL702_RF_TBB                  (BL702_RF_BASE + BL702_RF_TBB_OFFSET)
#define BL702_RF_LNA                  (BL702_RF_BASE + BL702_RF_LNA_OFFSET)
#define BL702_RF_RMXGM                (BL702_RF_BASE + BL702_RF_RMXGM_OFFSET)
#define BL702_RF_RBB1                 (BL702_RF_BASE + BL702_RF_RBB1_OFFSET)
#define BL702_RF_RBB2                 (BL702_RF_BASE + BL702_RF_RBB2_OFFSET)
#define BL702_RF_RBB3                 (BL702_RF_BASE + BL702_RF_RBB3_OFFSET)
#define BL702_RF_RBB4                 (BL702_RF_BASE + BL702_RF_RBB4_OFFSET)
#define BL702_RF_ADDA1                (BL702_RF_BASE + BL702_RF_ADDA1_OFFSET)
#define BL702_RF_ADDA2                (BL702_RF_BASE + BL702_RF_ADDA2_OFFSET)
#define BL702_RF_VCO1                 (BL702_RF_BASE + BL702_RF_VCO1_OFFSET)
#define BL702_RF_VCO2                 (BL702_RF_BASE + BL702_RF_VCO2_OFFSET)
#define BL702_RF_VCO3                 (BL702_RF_BASE + BL702_RF_VCO3_OFFSET)
#define BL702_RF_VCO4                 (BL702_RF_BASE + BL702_RF_VCO4_OFFSET)
#define BL702_RF_PFDCP                (BL702_RF_BASE + BL702_RF_PFDCP_OFFSET)
#define BL702_RF_LO                   (BL702_RF_BASE + BL702_RF_LO_OFFSET)
#define BL702_RF_FBDV                 (BL702_RF_BASE + BL702_RF_FBDV_OFFSET)
#define BL702_RF_LODIST               (BL702_RF_BASE + BL702_RF_LODIST_OFFSET)
#define BL702_RF_SDM1                 (BL702_RF_BASE + BL702_RF_SDM1_OFFSET)
#define BL702_RF_SDM2                 (BL702_RF_BASE + BL702_RF_SDM2_OFFSET)
#define BL702_RF_SDM3                 (BL702_RF_BASE + BL702_RF_SDM3_OFFSET)
#define BL702_RF_RESV_REG_0           (BL702_RF_BASE + BL702_RF_RESV_REG_0_OFFSET)
#define BL702_RF_RESV_REG_1           (BL702_RF_BASE + BL702_RF_RESV_REG_1_OFFSET)
#define BL702_RF_RESV_REG_2           (BL702_RF_BASE + BL702_RF_RESV_REG_2_OFFSET)
#define BL702_RRF_GAIN_INDEX1         (BL702_RF_BASE + BL702_RRF_GAIN_INDEX1_OFFSET)
#define BL702_RRF_GAIN_INDEX2         (BL702_RF_BASE + BL702_RRF_GAIN_INDEX2_OFFSET)
#define BL702_RF_LNA_CTRL_HW_MUX      (BL702_RF_BASE + BL702_RF_LNA_CTRL_HW_MUX_OFFSET)
#define BL702_RF_RBB_GAIN_INDEX1      (BL702_RF_BASE + BL702_RF_RBB_GAIN_INDEX1_OFFSET)
#define BL702_RF_RBB_GAIN_INDEX2      (BL702_RF_BASE + BL702_RF_RBB_GAIN_INDEX2_OFFSET)
#define BL702_RF_RBB_GAIN_INDEX3      (BL702_RF_BASE + BL702_RF_RBB_GAIN_INDEX3_OFFSET)
#define BL702_RF_RBB_GAIN_INDEX4      (BL702_RF_BASE + BL702_RF_RBB_GAIN_INDEX4_OFFSET)
#define BL702_RF_RBB_GAIN_INDEX5      (BL702_RF_BASE + BL702_RF_RBB_GAIN_INDEX5_OFFSET)
#define BL702_RF_TBB_GAIN_INDEX1      (BL702_RF_BASE + BL702_RF_TBB_GAIN_INDEX1_OFFSET)
#define BL702_RF_TBB_GAIN_INDEX2      (BL702_RF_BASE + BL702_RF_TBB_GAIN_INDEX2_OFFSET)
#define BL702_RF_TBB_GAIN_INDEX3      (BL702_RF_BASE + BL702_RF_TBB_GAIN_INDEX3_OFFSET)
#define BL702_RF_TBB_GAIN_INDEX4      (BL702_RF_BASE + BL702_RF_TBB_GAIN_INDEX4_OFFSET)
#define BL702_RF_PA_REG_CTRL_HW1      (BL702_RF_BASE + BL702_RF_PA_REG_CTRL_HW1_OFFSET)
#define BL702_RF_PA_REG_CTRL_HW2      (BL702_RF_BASE + BL702_RF_PA_REG_CTRL_HW2_OFFSET)
#define BL702_RF_PA_REG_WIFI_CTRL_HW  (BL702_RF_BASE + BL702_RF_PA_REG_WIFI_CTRL_HW_OFFSET)
#define BL702_RF_ADDA_REG_CTRL_HW     (BL702_RF_BASE + BL702_RF_ADDA_REG_CTRL_HW_OFFSET)
#define BL702_RF_LO_REG_CTRL_HW1      (BL702_RF_BASE + BL702_RF_LO_REG_CTRL_HW1_OFFSET)
#define BL702_RF_LO_CAL_CTRL_HW1      (BL702_RF_BASE + BL702_RF_LO_CAL_CTRL_HW1_OFFSET)
#define BL702_RF_LO_CAL_CTRL_HW2      (BL702_RF_BASE + BL702_RF_LO_CAL_CTRL_HW2_OFFSET)
#define BL702_RF_LO_CAL_CTRL_HW3      (BL702_RF_BASE + BL702_RF_LO_CAL_CTRL_HW3_OFFSET)
#define BL702_RF_LO_CAL_CTRL_HW4      (BL702_RF_BASE + BL702_RF_LO_CAL_CTRL_HW4_OFFSET)
#define BL702_RF_LO_CAL_CTRL_HW5      (BL702_RF_BASE + BL702_RF_LO_CAL_CTRL_HW5_OFFSET)
#define BL702_RF_LO_CAL_CTRL_HW6      (BL702_RF_BASE + BL702_RF_LO_CAL_CTRL_HW6_OFFSET)
#define BL702_RF_LO_CAL_CTRL_HW7      (BL702_RF_BASE + BL702_RF_LO_CAL_CTRL_HW7_OFFSET)
#define BL702_RF_LO_CAL_CTRL_HW8      (BL702_RF_BASE + BL702_RF_LO_CAL_CTRL_HW8_OFFSET)
#define BL702_RF_LO_CAL_CTRL_HW9      (BL702_RF_BASE + BL702_RF_LO_CAL_CTRL_HW9_OFFSET)
#define BL702_RF_LO_CAL_CTRL_HW10     (BL702_RF_BASE + BL702_RF_LO_CAL_CTRL_HW10_OFFSET)
#define BL702_RF_LO_CAL_CTRL_HW11     (BL702_RF_BASE + BL702_RF_LO_CAL_CTRL_HW11_OFFSET)
#define BL702_RF_ROSDAC_CTRL_HW1      (BL702_RF_BASE + BL702_RF_ROSDAC_CTRL_HW1_OFFSET)
#define BL702_RF_ROSDAC_CTRL_HW2      (BL702_RF_BASE + BL702_RF_ROSDAC_CTRL_HW2_OFFSET)
#define BL702_RF_RXIQ_CTRL_HW1        (BL702_RF_BASE + BL702_RF_RXIQ_CTRL_HW1_OFFSET)
#define BL702_RF_RXIQ_CTRL_HW2        (BL702_RF_BASE + BL702_RF_RXIQ_CTRL_HW2_OFFSET)
#define BL702_RF_RXIQ_CTRL_HW3        (BL702_RF_BASE + BL702_RF_RXIQ_CTRL_HW3_OFFSET)
#define BL702_RF_RXIQ_CTRL_HW4        (BL702_RF_BASE + BL702_RF_RXIQ_CTRL_HW4_OFFSET)
#define BL702_RF_TOSDAC_CTRL_HW1      (BL702_RF_BASE + BL702_RF_TOSDAC_CTRL_HW1_OFFSET)
#define BL702_RF_TOSDAC_CTRL_HW2      (BL702_RF_BASE + BL702_RF_TOSDAC_CTRL_HW2_OFFSET)
#define BL702_RF_TOSDAC_CTRL_HW3      (BL702_RF_BASE + BL702_RF_TOSDAC_CTRL_HW3_OFFSET)
#define BL702_RF_TOSDAC_CTRL_HW4      (BL702_RF_BASE + BL702_RF_TOSDAC_CTRL_HW4_OFFSET)
#define BL702_RF_TX_IQ_GAIN_HW0       (BL702_RF_BASE + BL702_RF_TX_IQ_GAIN_HW0_OFFSET)
#define BL702_RF_TX_IQ_GAIN_HW1       (BL702_RF_BASE + BL702_RF_TX_IQ_GAIN_HW1_OFFSET)
#define BL702_RF_TX_IQ_GAIN_HW2       (BL702_RF_BASE + BL702_RF_TX_IQ_GAIN_HW2_OFFSET)
#define BL702_RF_TX_IQ_GAIN_HW3       (BL702_RF_BASE + BL702_RF_TX_IQ_GAIN_HW3_OFFSET)
#define BL702_RF_TX_IQ_GAIN_HW4       (BL702_RF_BASE + BL702_RF_TX_IQ_GAIN_HW4_OFFSET)
#define BL702_RF_TX_IQ_GAIN_HW5       (BL702_RF_BASE + BL702_RF_TX_IQ_GAIN_HW5_OFFSET)
#define BL702_RF_TX_IQ_GAIN_HW6       (BL702_RF_BASE + BL702_RF_TX_IQ_GAIN_HW6_OFFSET)
#define BL702_RF_TX_IQ_GAIN_HW7       (BL702_RF_BASE + BL702_RF_TX_IQ_GAIN_HW7_OFFSET)
#define BL702_RF_LO_SDM_CTRL_HW1      (BL702_RF_BASE + BL702_RF_LO_SDM_CTRL_HW1_OFFSET)
#define BL702_RF_LO_SDM_CTRL_HW2      (BL702_RF_BASE + BL702_RF_LO_SDM_CTRL_HW2_OFFSET)
#define BL702_RF_LO_SDM_CTRL_HW3      (BL702_RF_BASE + BL702_RF_LO_SDM_CTRL_HW3_OFFSET)
#define BL702_RF_LO_SDM_CTRL_HW4      (BL702_RF_BASE + BL702_RF_LO_SDM_CTRL_HW4_OFFSET)
#define BL702_RF_LO_SDM_CTRL_HW5      (BL702_RF_BASE + BL702_RF_LO_SDM_CTRL_HW5_OFFSET)
#define BL702_RF_LO_SDM_CTRL_HW6      (BL702_RF_BASE + BL702_RF_LO_SDM_CTRL_HW6_OFFSET)
#define BL702_RF_LO_SDM_CTRL_HW7      (BL702_RF_BASE + BL702_RF_LO_SDM_CTRL_HW7_OFFSET)
#define BL702_RF_LO_SDM_CTRL_HW8      (BL702_RF_BASE + BL702_RF_LO_SDM_CTRL_HW8_OFFSET)
#define BL702_RF_RBB_BW_CTRL_HW       (BL702_RF_BASE + BL702_RF_RBB_BW_CTRL_HW_OFFSET)
#define BL702_RF_SINGEN_CTRL0         (BL702_RF_BASE + BL702_RF_SINGEN_CTRL0_OFFSET)
#define BL702_RF_SINGEN_CTRL1         (BL702_RF_BASE + BL702_RF_SINGEN_CTRL1_OFFSET)
#define BL702_RF_SINGEN_CTRL2         (BL702_RF_BASE + BL702_RF_SINGEN_CTRL2_OFFSET)
#define BL702_RF_SINGEN_CTRL3         (BL702_RF_BASE + BL702_RF_SINGEN_CTRL3_OFFSET)
#define BL702_RF_SINGEN_CTRL4         (BL702_RF_BASE + BL702_RF_SINGEN_CTRL4_OFFSET)
#define BL702_RF_RFIF_DFE_CTRL0       (BL702_RF_BASE + BL702_RF_RFIF_DFE_CTRL0_OFFSET)
#define BL702_RF_RFIF_TEST_READ       (BL702_RF_BASE + BL702_RF_RFIF_TEST_READ_OFFSET)
#define BL702_RF_RFIF_DIG_CTRL        (BL702_RF_BASE + BL702_RF_RFIF_DIG_CTRL_OFFSET)
#define BL702_RF_DATA_TEMP_0          (BL702_RF_BASE + BL702_RF_DATA_TEMP_0_OFFSET)
#define BL702_RF_DATA_TEMP_1          (BL702_RF_BASE + BL702_RF_DATA_TEMP_1_OFFSET)
#define BL702_RF_DATA_TEMP_2          (BL702_RF_BASE + BL702_RF_DATA_TEMP_2_OFFSET)
#define BL702_RF_DATA_TEMP_3          (BL702_RF_BASE + BL702_RF_DATA_TEMP_3_OFFSET)
#define BL702_RF_SRAM_CTRL0           (BL702_RF_BASE + BL702_RF_SRAM_CTRL0_OFFSET)
#define BL702_RF_SRAM_CTRL1           (BL702_RF_BASE + BL702_RF_SRAM_CTRL1_OFFSET)
#define BL702_RF_SRAM_CTRL2           (BL702_RF_BASE + BL702_RF_SRAM_CTRL2_OFFSET)
#define BL702_RF_SRAM_CTRL3           (BL702_RF_BASE + BL702_RF_SRAM_CTRL3_OFFSET)
#define BL702_RF_SRAM_CTRL4           (BL702_RF_BASE + BL702_RF_SRAM_CTRL4_OFFSET)
#define BL702_RF_SRAM_CTRL5           (BL702_RF_BASE + BL702_RF_SRAM_CTRL5_OFFSET)
#define BL702_RF_SRAM_CTRL6           (BL702_RF_BASE + BL702_RF_SRAM_CTRL6_OFFSET)
#define BL702_RF_ICAL_CTRL0           (BL702_RF_BASE + BL702_RF_ICAL_CTRL0_OFFSET)
#define BL702_RF_ICAL_CTRL1           (BL702_RF_BASE + BL702_RF_ICAL_CTRL1_OFFSET)
#define BL702_RF_ICAL_CTRL2           (BL702_RF_BASE + BL702_RF_ICAL_CTRL2_OFFSET)
#define BL702_RF_FSM_CTRL0            (BL702_RF_BASE + BL702_RF_FSM_CTRL0_OFFSET)
#define BL702_RF_FSM_CTRL1            (BL702_RF_BASE + BL702_RF_FSM_CTRL1_OFFSET)
#define BL702_RF_FSM_CTRL2            (BL702_RF_BASE + BL702_RF_FSM_CTRL2_OFFSET)
#define BL702_RF_PKDET_CTRL0          (BL702_RF_BASE + BL702_RF_PKDET_CTRL0_OFFSET)
#define BL702_RF_DFE_CTRL_0           (BL702_RF_BASE + BL702_RF_DFE_CTRL_0_OFFSET)
#define BL702_RF_DFE_CTRL_1           (BL702_RF_BASE + BL702_RF_DFE_CTRL_1_OFFSET)
#define BL702_RF_DFE_CTRL_2           (BL702_RF_BASE + BL702_RF_DFE_CTRL_2_OFFSET)
#define BL702_RF_DFE_CTRL_3           (BL702_RF_BASE + BL702_RF_DFE_CTRL_3_OFFSET)
#define BL702_RF_DFE_CTRL_4           (BL702_RF_BASE + BL702_RF_DFE_CTRL_4_OFFSET)
#define BL702_RF_DFE_CTRL_5           (BL702_RF_BASE + BL702_RF_DFE_CTRL_5_OFFSET)
#define BL702_RF_DFE_CTRL_6           (BL702_RF_BASE + BL702_RF_DFE_CTRL_6_OFFSET)
#define BL702_RF_DFE_CTRL_7           (BL702_RF_BASE + BL702_RF_DFE_CTRL_7_OFFSET)
#define BL702_RF_DFE_CTRL_8           (BL702_RF_BASE + BL702_RF_DFE_CTRL_8_OFFSET)
#define BL702_RF_DFE_CTRL_9           (BL702_RF_BASE + BL702_RF_DFE_CTRL_9_OFFSET)
#define BL702_RF_DFE_CTRL_10          (BL702_RF_BASE + BL702_RF_DFE_CTRL_10_OFFSET)
#define BL702_RF_DFE_CTRL_11          (BL702_RF_BASE + BL702_RF_DFE_CTRL_11_OFFSET)
#define BL702_RF_DFE_CTRL_12          (BL702_RF_BASE + BL702_RF_DFE_CTRL_12_OFFSET)
#define BL702_RF_DFE_CTRL_13          (BL702_RF_BASE + BL702_RF_DFE_CTRL_13_OFFSET)
#define BL702_RF_DFE_CTRL_14          (BL702_RF_BASE + BL702_RF_DFE_CTRL_14_OFFSET)
#define BL702_RF_DFE_CTRL_15          (BL702_RF_BASE + BL702_RF_DFE_CTRL_15_OFFSET)
#define BL702_RF_DFE_CTRL_16          (BL702_RF_BASE + BL702_RF_DFE_CTRL_16_OFFSET)
#define BL702_RF_DFE_CTRL_17          (BL702_RF_BASE + BL702_RF_DFE_CTRL_17_OFFSET)
#define BL702_RF_DFE_CTRL_18          (BL702_RF_BASE + BL702_RF_DFE_CTRL_18_OFFSET)

/* Register bit definitions *************************************************/

