e-yes/nuttx/arch/risc-v/src/bl702/hardware/bl702_rf.h
#define RF_REV_HW_REV_SHIFT                                (16)
#define RF_REV_HW_REV_MASK                                 (0xff << RF_REV_HW_REV_SHIFT)
#define RF_REV_FW_REV_SHIFT                                (8)
#define RF_REV_FW_REV_MASK                                 (0xff << RF_REV_FW_REV_SHIFT)
#define RF_REV_RF_ID_MASK                                  (0xff)

#define RF_FSM_CTRL_HW_RF_RC_STATE_VALUE_SHIFT             (28)
#define RF_FSM_CTRL_HW_RF_RC_STATE_VALUE_MASK              (0x07 << RF_FSM_CTRL_HW_RF_RC_STATE_VALUE_SHIFT)
#define RF_FSM_CTRL_HW_RF_FSM_ST_INT_SET                   (1 << 24)
#define RF_FSM_CTRL_HW_RF_FSM_ST_INT_CLR                   (1 << 20)
#define RF_FSM_CTRL_HW_RF_FSM_ST_INT                       (1 << 16)
#define RF_FSM_CTRL_HW_RF_FSM_ST_INT_SEL_SHIFT             (12)
#define RF_FSM_CTRL_HW_RF_FSM_ST_INT_SEL_MASK              (0x07 << RF_FSM_CTRL_HW_RF_FSM_ST_INT_SEL_SHIFT)
#define RF_FSM_CTRL_HW_RF_RC_STATE_DBG_EN                  (1 << 11)
#define RF_FSM_CTRL_HW_RF_RC_STATE_DBG_SHIFT               (8)
#define RF_FSM_CTRL_HW_RF_RC_STATE_DBG_MASK                (0x07 << RF_FSM_CTRL_HW_RF_RC_STATE_DBG_SHIFT)
#define RF_FSM_CTRL_HW_RF_FSM_STATE_SHIFT                  (4)
#define RF_FSM_CTRL_HW_RF_FSM_STATE_MASK                   (0x07 << RF_FSM_CTRL_HW_RF_FSM_STATE_SHIFT)
#define RF_FSM_CTRL_HW_RF_FSM_T2R_CAL_MODE_SHIFT           (2)
#define RF_FSM_CTRL_HW_RF_FSM_T2R_CAL_MODE_MASK            (0x03 << RF_FSM_CTRL_HW_RF_FSM_T2R_CAL_MODE_SHIFT)
#define RF_FSM_CTRL_HW_RF_FSM_CTRL_EN                      (1 << 1)

#define RF_FSM_CTRL_SW_LO_UNLOCKED                         (1 << 20)
#define RF_FSM_CTRL_SW_INC_CAL_TIMEOUT                     (1 << 16)
#define RF_FSM_CTRL_SW_FULL_CAL_EN                         (1 << 12)
#define RF_FSM_CTRL_SW_RF_FSM_SW_ST_VLD                    (1 << 8)
#define RF_FSM_CTRL_SW_RF_FSM_SW_ST_MASK                   (0x1f)

#define RFCTRL_HW_EN_ADDA_CTRL_HW                          (1 << 12)
#define RFCTRL_HW_EN_RBB_PKDET_OUT_RSTN_CTRL_HW            (1 << 11)
#define RFCTRL_HW_EN_RBB_PKDET_EN_CTRL_HW                  (1 << 10)
#define RFCTRL_HW_EN_SDM_CTRL_HW                           (1 << 9)
#define RFCTRL_HW_EN_INC_FCAL_CTRL_EN_HW                   (1 << 8)
#define RFCTRL_HW_EN_INC_ACAL_CTRL_EN_HW                   (1 << 7)
#define RFCTRL_HW_EN_LO_CTRL_HW                            (1 << 6)
#define RFCTRL_HW_EN_TRXCAL_CTRL_HW                        (1 << 5)
#define RFCTRL_HW_EN_RBB_BW_CTRL_HW                        (1 << 4)
#define RFCTRL_HW_EN_LNA_CTRL_HW                           (1 << 3)
#define RFCTRL_HW_EN_TX_GAIN_CTRL_HW                       (1 << 2)
#define RFCTRL_HW_EN_RX_GAIN_CTRL_HW                       (1 << 1)
#define RFCTRL_HW_EN_PU_CTRL_HW                            (1 << 0)

#define RF_TEMP_COMP_TEMP_COMP_EN                             (1 << 16)
#define RF_TEMP_COMP_CONST_FCAL_SHIFT                         (8)
#define RF_TEMP_COMP_CONST_FCAL_MASK                          (0xff << RF_TEMP_COMP_CONST_FCAL_SHIFT)
#define RF_TEMP_COMP_CONST_ACAL_MASK                          (0xff)

#define RFCAL_STATUS_DPD_STATUS_SHIFT                      (30)
#define RFCAL_STATUS_DPD_STATUS_MASK                       (0x03 << RFCAL_STATUS_DPD_STATUS_SHIFT)
#define RFCAL_STATUS_TENSCAL_STATUS_SHIFT                  (28)
#define RFCAL_STATUS_TENSCAL_STATUS_MASK                   (0x03 << RFCAL_STATUS_TENSCAL_STATUS_SHIFT)
#define RFCAL_STATUS_PWDET_CAL_STATUS_SHIFT                (26)
#define RFCAL_STATUS_PWDET_CAL_STATUS_MASK                 (0x03 << RFCAL_STATUS_PWDET_CAL_STATUS_SHIFT)
#define RFCAL_STATUS_RIQCAL_STATUS_RESV_SHIFT              (24)
#define RFCAL_STATUS_RIQCAL_STATUS_RESV_MASK               (0x03 << RFCAL_STATUS_RIQCAL_STATUS_RESV_SHIFT)
#define RFCAL_STATUS_TIQCAL_STATUS_RESV_SHIFT              (22)
#define RFCAL_STATUS_TIQCAL_STATUS_RESV_MASK               (0x03 << RFCAL_STATUS_TIQCAL_STATUS_RESV_SHIFT)
#define RFCAL_STATUS_LO_LEAKCAL_STATUS_SHIFT               (20)
#define RFCAL_STATUS_LO_LEAKCAL_STATUS_MASK                (0x03 << RFCAL_STATUS_LO_LEAKCAL_STATUS_SHIFT)
#define RFCAL_STATUS_RCCAL_STATUS_SHIFT                    (18)
#define RFCAL_STATUS_RCCAL_STATUS_MASK                     (0x03 << RFCAL_STATUS_RCCAL_STATUS_SHIFT)
#define RFCAL_STATUS_TOS_STATUS_SHIFT                      (16)
#define RFCAL_STATUS_TOS_STATUS_MASK                       (0x03 << RFCAL_STATUS_TOS_STATUS_SHIFT)
#define RFCAL_STATUS_ROS_STATUS_SHIFT                      (14)
#define RFCAL_STATUS_ROS_STATUS_MASK                       (0x03 << RFCAL_STATUS_ROS_STATUS_SHIFT)
#define RFCAL_STATUS_CLKPLL_CAL_STATUS_SHIFT               (12)
#define RFCAL_STATUS_CLKPLL_CAL_STATUS_MASK                (0x03 << RFCAL_STATUS_CLKPLL_CAL_STATUS_SHIFT)
#define RFCAL_STATUS_INC_ACAL_STATUS_SHIFT                 (10)
#define RFCAL_STATUS_INC_ACAL_STATUS_MASK                  (0x03 << RFCAL_STATUS_INC_ACAL_STATUS_SHIFT)
#define RFCAL_STATUS_INC_FCAL_STATUS_SHIFT                 (8)
#define RFCAL_STATUS_INC_FCAL_STATUS_MASK                  (0x03 << RFCAL_STATUS_INC_FCAL_STATUS_SHIFT)
#define RFCAL_STATUS_ACAL_STATUS_SHIFT                     (6)
#define RFCAL_STATUS_ACAL_STATUS_MASK                      (0x03 << RFCAL_STATUS_ACAL_STATUS_SHIFT)
#define RFCAL_STATUS_FCAL_STATUS_SHIFT                     (4)
#define RFCAL_STATUS_FCAL_STATUS_MASK                      (0x03 << RFCAL_STATUS_FCAL_STATUS_SHIFT)
#define RFCAL_STATUS_ADC_OSCAL_STATUS_SHIFT                (2)
#define RFCAL_STATUS_ADC_OSCAL_STATUS_MASK                 (0x03 << RFCAL_STATUS_ADC_OSCAL_STATUS_SHIFT)
#define RFCAL_STATUS_RCAL_STATUS_MASK                      (0x03)

#define RFCAL_STATUS2_DL_RFCAL_TABLE_STATUS_MASK           (0x03)

#define RFCAL_CTRLEN_DPD_EN                                (1 << 17)
#define RFCAL_CTRLEN_TSENCAL_EN                            (1 << 16)
#define RFCAL_CTRLEN_PWDET_CAL_EN                          (1 << 15)
#define RFCAL_CTRLEN_RIQCAL_EN                             (1 << 14)
#define RFCAL_CTRLEN_TIQCAL_EN                             (1 << 13)
#define RFCAL_CTRLEN_LO_LEAKCAL_EN                         (1 << 12)
#define RFCAL_CTRLEN_RCCAL_EN                              (1 << 11)
#define RFCAL_CTRLEN_TOSCAL_EN                             (1 << 10)
#define RFCAL_CTRLEN_ROSCAL_EN                             (1 << 9)
#define RFCAL_CTRLEN_CLKPLL_CAL_EN                         (1 << 8)
#define RFCAL_CTRLEN_ROSCAL_INC_EN                         (1 << 7)
#define RFCAL_CTRLEN_ACAL_INC_EN                           (1 << 6)
#define RFCAL_CTRLEN_FCAL_INC_EN                           (1 << 5)
#define RFCAL_CTRLEN_ACAL_EN                               (1 << 4)
#define RFCAL_CTRLEN_FCAL_EN                               (1 << 3)
#define RFCAL_CTRLEN_DL_RFCAL_TABLE_EN                     (1 << 2)
#define RFCAL_CTRLEN_ADC_OSCAL_EN                          (1 << 1)
#define RFCAL_CTRLEN_RCAL_EN_RESV                          (1 << 0)

