e-yes/nuttx/arch/risc-v/src/bl702/hardware/bl702_rf.h
#define RFCAL_STATEEN_RFCAL_LEVEL_SHIFT                    (30)
#define RFCAL_STATEEN_RFCAL_LEVEL_MASK                     (0x03 << RFCAL_STATEEN_RFCAL_LEVEL_SHIFT)
#define RFCAL_STATEEN_DPD_STEN                             (1 << 16)
#define RFCAL_STATEEN_TSENCAL_STEN                         (1 << 15)
#define RFCAL_STATEEN_PWDET_CAL_STEN                       (1 << 14)
#define RFCAL_STATEEN_RIQCAL_STEN                          (1 << 13)
#define RFCAL_STATEEN_TIQCAL_STEN                          (1 << 12)
#define RFCAL_STATEEN_LO_LEAKCAL_STEN                      (1 << 11)
#define RFCAL_STATEEN_RCCAL_STEN                           (1 << 10)
#define RFCAL_STATEEN_TOSCAL_STEN_RESV                     (1 << 9)
#define RFCAL_STATEEN_ROSCAL_STEN                          (1 << 8)
#define RFCAL_STATEEN_CLKPLL_CAL_STEN                      (1 << 7)
#define RFCAL_STATEEN_INC_ACAL_STEN                        (1 << 6)
#define RFCAL_STATEEN_INC_FCAL_STEN                        (1 << 5)
#define RFCAL_STATEEN_ACAL_STEN                            (1 << 4)
#define RFCAL_STATEEN_FCAL_STEN                            (1 << 3)
#define RFCAL_STATEEN_DL_RFCAL_TABLE_STEN                  (1 << 2)
#define RFCAL_STATEEN_ADC_OSCAL_STEN                       (1 << 1)
#define RFCAL_STATEEN_RCAL_STEN_RESV                       (1 << 0)

#define RF_BASE_CTRL1_MBG_TRIM_SHIFT                       (27)
#define RF_BASE_CTRL1_MBG_TRIM_MASK                        (0x03 << RF_BASE_CTRL1_MBG_TRIM_SHIFT)
#define RF_BASE_CTRL1_PUD_PA_DLY_SHIFT                     (14)
#define RF_BASE_CTRL1_PUD_PA_DLY_MASK                      (0x03 << RF_BASE_CTRL1_PUD_PA_DLY_SHIFT)
#define RF_BASE_CTRL1_PUD_IREF_DLY_SHIFT                   (12)
#define RF_BASE_CTRL1_PUD_IREF_DLY_MASK                    (0x03 << RF_BASE_CTRL1_PUD_IREF_DLY_SHIFT)
#define RF_BASE_CTRL1_PUD_VCO_DLY_SHIFT                    (10)
#define RF_BASE_CTRL1_PUD_VCO_DLY_MASK                     (0x03 << RF_BASE_CTRL1_PUD_VCO_DLY_SHIFT)
#define RF_BASE_CTRL1_PPU_LEAD_SHIFT                       (8)
#define RF_BASE_CTRL1_PPU_LEAD_MASK                        (0x03 << RF_BASE_CTRL1_PPU_LEAD_SHIFT)
#define RF_BASE_CTRL1_LO_SDM_RST_DLY_SHIFT                 (2)
#define RF_BASE_CTRL1_LO_SDM_RST_DLY_MASK                  (0x03 << RF_BASE_CTRL1_LO_SDM_RST_DLY_SHIFT)
#define RF_BASE_CTRL1_AUPLL_SDM_RST_DLY_MASK               (0x03)

#define RF_PUCR1_PU_TOSDAC                                    (1 << 31)
#define RF_PUCR1_PU_PWRMX                                     (1 << 30)
#define RF_PUCR1_PU_ROSDAC                                    (1 << 29)
#define RF_PUCR1_PU_PKDET                                     (1 << 28)
#define RF_PUCR1_TRSW_EN                                      (1 << 26)
#define RF_PUCR1_PU_TXBUF                                     (1 << 25)
#define RF_PUCR1_PU_RXBUF                                     (1 << 24)
#define RF_PUCR1_PU_OSMX                                      (1 << 23)
#define RF_PUCR1_PU_PFD                                       (1 << 22)
#define RF_PUCR1_PU_FBDV                                      (1 << 21)
#define RF_PUCR1_PU_VCO                                       (1 << 20)
#define RF_PUCR1_PU_DAC                                       (1 << 19)
#define RF_PUCR1_PU_TBB                                       (1 << 18)
#define RF_PUCR1_PU_TMX                                       (1 << 17)
#define RF_PUCR1_PU_PA                                        (1 << 16)
#define RF_PUCR1_PU_OP_ATEST                                  (1 << 15)
#define RF_PUCR1_PU_ADC                                       (1 << 14)
#define RF_PUCR1_ADC_CLK_EN                                   (1 << 13)
#define RF_PUCR1_PU_ADDA_LDO                                  (1 << 12)
#define RF_PUCR1_PU_RBB                                       (1 << 11)
#define RF_PUCR1_PU_RMX                                       (1 << 10)
#define RF_PUCR1_PU_RMXGM                                     (1 << 9)
#define RF_PUCR1_PU_LNA                                       (1 << 8)
#define RF_PUCR1_PU_SFREG                                     (1 << 0)

#define RF_PUCR1_HW_PU_TOSDAC_HW                              (1 << 31)
#define RF_PUCR1_HW_PU_ROSDAC_HW                              (1 << 29)
#define RF_PUCR1_HW_PU_PKDET_HW                               (1 << 28)
#define RF_PUCR1_HW_TRSW_EN_HW                                (1 << 26)
#define RF_PUCR1_HW_PU_TXBUF_HW                               (1 << 25)
#define RF_PUCR1_HW_PU_RXBUF_HW                               (1 << 24)
#define RF_PUCR1_HW_PU_OSMX_HW                                (1 << 23)
#define RF_PUCR1_HW_PU_PFD_HW                                 (1 << 22)
#define RF_PUCR1_HW_PU_FBDV_HW                                (1 << 21)
#define RF_PUCR1_HW_PU_VCO_HW                                 (1 << 20)
#define RF_PUCR1_HW_PU_DAC_HW                                 (1 << 19)
#define RF_PUCR1_HW_PU_TBB_HW                                 (1 << 18)
#define RF_PUCR1_HW_PU_TMX_HW                                 (1 << 17)
#define RF_PUCR1_HW_PU_PA_HW                                  (1 << 16)
#define RF_PUCR1_HW_PU_ADC_HW                                 (1 << 14)
#define RF_PUCR1_HW_ADC_CLK_EN_HW                             (1 << 13)
#define RF_PUCR1_HW_PU_ADDA_LDO_HW                            (1 << 12)
#define RF_PUCR1_HW_PU_RBB_HW                                 (1 << 11)
#define RF_PUCR1_HW_PU_RMX_HW                                 (1 << 10)
#define RF_PUCR1_HW_PU_RMXGM_HW                               (1 << 9)
#define RF_PUCR1_HW_PU_LNA_HW                                 (1 << 8)
#define RF_PUCR1_HW_PU_SFREG_HW                               (1 << 0)

#define RF_PPU_CTRL_HW_PPU_TXBUF_HW                           (1 << 25)
#define RF_PPU_CTRL_HW_PPU_RXBUF_HW                           (1 << 24)
#define RF_PPU_CTRL_HW_PPU_OSMX_HW                            (1 << 23)
#define RF_PPU_CTRL_HW_PPU_PFD_HW                             (1 << 22)
#define RF_PPU_CTRL_HW_PPU_FBDV_HW                            (1 << 21)
#define RF_PPU_CTRL_HW_PPU_VCO_HW                             (1 << 20)
#define RF_PPU_CTRL_HW_PPU_RBB_HW                             (1 << 11)
#define RF_PPU_CTRL_HW_PPU_RMXGM_HW                           (1 << 9)
#define RF_PPU_CTRL_HW_PPU_LNA_HW                             (1 << 8)

#define RF_PUD_CTRL_HW_PUD_VCO_HW                             (1 << 20)

#define RF_TRX_GAIN1_GC_TBB_BOOST_SHIFT                       (28)
#define RF_TRX_GAIN1_GC_TBB_BOOST_MASK                        (0x03 << RF_TRX_GAIN1_GC_TBB_BOOST_SHIFT)
#define RF_TRX_GAIN1_GC_TBB_SHIFT                             (20)
#define RF_TRX_GAIN1_GC_TBB_MASK                              (0x1f << RF_TRX_GAIN1_GC_TBB_SHIFT)
#define RF_TRX_GAIN1_GC_TMX_SHIFT                             (16)
#define RF_TRX_GAIN1_GC_TMX_MASK                              (0x07 << RF_TRX_GAIN1_GC_TMX_SHIFT)
#define RF_TRX_GAIN1_GC_RBB2_SHIFT                            (12)
#define RF_TRX_GAIN1_GC_RBB2_MASK                             (0x07 << RF_TRX_GAIN1_GC_RBB2_SHIFT)
#define RF_TRX_GAIN1_GC_RBB1_SHIFT                            (8)
#define RF_TRX_GAIN1_GC_RBB1_MASK                             (0x03 << RF_TRX_GAIN1_GC_RBB1_SHIFT)
#define RF_TRX_GAIN1_GC_RMXGM_SHIFT                           (4)
#define RF_TRX_GAIN1_GC_RMXGM_MASK                            (0x03 << RF_TRX_GAIN1_GC_RMXGM_SHIFT)
#define RF_TRX_GAIN1_GC_LNA_MASK                              (0x07)

#define RF_TRX_GAIN_HW_GC_TBB_BOOST_HW_SHIFT                  (28)
#define RF_TRX_GAIN_HW_GC_TBB_BOOST_HW_MASK                   (0x03 << RF_TRX_GAIN_HW_GC_TBB_BOOST_HW_SHIFT)
#define RF_TRX_GAIN_HW_GC_TBB_HW_SHIFT                        (20)
#define RF_TRX_GAIN_HW_GC_TBB_HW_MASK                         (0x1f << RF_TRX_GAIN_HW_GC_TBB_HW_SHIFT)
#define RF_TRX_GAIN_HW_GC_TMX_HW_SHIFT                        (16)
#define RF_TRX_GAIN_HW_GC_TMX_HW_MASK                         (0x07 << RF_TRX_GAIN_HW_GC_TMX_HW_SHIFT)
#define RF_TRX_GAIN_HW_GC_RBB2_HW_SHIFT                       (12)
#define RF_TRX_GAIN_HW_GC_RBB2_HW_MASK                        (0x07 << RF_TRX_GAIN_HW_GC_RBB2_HW_SHIFT)
#define RF_TRX_GAIN_HW_GC_RBB1_HW_SHIFT                       (8)
#define RF_TRX_GAIN_HW_GC_RBB1_HW_MASK                        (0x03 << RF_TRX_GAIN_HW_GC_RBB1_HW_SHIFT)
#define RF_TRX_GAIN_HW_GC_RMXGM_HW_SHIFT                      (4)
#define RF_TRX_GAIN_HW_GC_RMXGM_HW_MASK                       (0x03 << RF_TRX_GAIN_HW_GC_RMXGM_HW_SHIFT)
#define RF_TRX_GAIN_HW_GC_LNA_HW_MASK                         (0x07)

#define RF_TEN_DC_TEN_LODIST                                  (1 << 27)
#define RF_TEN_DC_TEN_LF                                      (1 << 26)
#define RF_TEN_DC_TEN_PFDCP                                   (1 << 25)
#define RF_TEN_DC_TEN_VCO                                     (1 << 24)
#define RF_TEN_DC_TEN_DAC_Q                                   (1 << 22)
#define RF_TEN_DC_TEN_DAC_I                                   (1 << 21)
#define RF_TEN_DC_TEN_ADC                                     (1 << 20)
#define RF_TEN_DC_TEN_TBB                                     (1 << 19)
#define RF_TEN_DC_TEN_ATEST                                   (1 << 18)
#define RF_TEN_DC_TEN_BQ                                      (1 << 17)
#define RF_TEN_DC_TEN_TIA                                     (1 << 16)
#define RF_TEN_DC_TEN_TMX                                     (1 << 15)
#define RF_TEN_DC_TEN_PA                                      (1 << 14)
#define RF_TEN_DC_TEN_RRF_1                                   (1 << 13)
#define RF_TEN_DC_TEN_RRF_0                                   (1 << 12)
#define RF_TEN_DC_TEN_CLKPLL_SFREG                            (1 << 9)
#define RF_TEN_DC_TEN_CLKPLL                                  (1 << 8)
#define RF_TEN_DC_DC_TP_CLKPLL_EN                             (1 << 4)
#define RF_TEN_DC_DC_TP_EN                                    (1 << 3)
#define RF_TEN_DC_TMUX_MASK                                   (0x07)

#define RF_TEN_DIG_RF_DTEST_EN                                (1 << 23)
#define RF_TEN_DIG_DTEST_PULL_DOWN                            (1 << 9)
#define RF_TEN_DIG_DTEN_LO_FREF                               (1 << 8)
#define RF_TEN_DIG_DTEN_LO_FSDM                               (1 << 6)
#define RF_TEN_DIG_DTEN_CLKPLL_FIN                            (1 << 5)
#define RF_TEN_DIG_DTEN_CLKPLL_FREF                           (1 << 4)
#define RF_TEN_DIG_DTEN_CLKPLL_FSDM                           (1 << 3)
#define RF_TEN_DIG_DTEN_CLKPLL_CLK32M                         (1 << 2)
#define RF_TEN_DIG_DTEN_CLKPLL_CLK96M                         (1 << 1)
#define RF_TEN_DIG_DTEN_CLKPLL_POSTDIV_CLK                    (1 << 0)

#define RF_TEN_AC_ATEST_IN_EN_I                               (1 << 23)
#define RF_TEN_AC_ATEST_IN_EN_Q                               (1 << 22)
#define RF_TEN_AC_ATEST_OUT_EN_I                              (1 << 21)
#define RF_TEN_AC_ATEST_OUT_EN_Q                              (1 << 20)
#define RF_TEN_AC_ATEST_GAIN_R5_SHIFT                         (16)
#define RF_TEN_AC_ATEST_GAIN_R5_MASK                          (0x07 << RF_TEN_AC_ATEST_GAIN_R5_SHIFT)
#define RF_TEN_AC_ATEST_GAIN_R6_SHIFT                         (14)
#define RF_TEN_AC_ATEST_GAIN_R6_MASK                          (0x03 << RF_TEN_AC_ATEST_GAIN_R6_SHIFT)
#define RF_TEN_AC_ATEST_GAIN_R7_SHIFT                         (12)
#define RF_TEN_AC_ATEST_GAIN_R7_MASK                          (0x03 << RF_TEN_AC_ATEST_GAIN_R7_SHIFT)
#define RF_TEN_AC_ATEST_GAIN_R8_SHIFT                         (10)
#define RF_TEN_AC_ATEST_GAIN_R8_MASK                          (0x03 << RF_TEN_AC_ATEST_GAIN_R8_SHIFT)
#define RF_TEN_AC_ATEST_GAIN_R9_SHIFT                         (8)
#define RF_TEN_AC_ATEST_GAIN_R9_MASK                          (0x03 << RF_TEN_AC_ATEST_GAIN_R9_SHIFT)
#define RF_TEN_AC_ATEST_IN_EN                                 (1 << 6)
#define RF_TEN_AC_ATEST_IN_TRX_SW                             (1 << 5)
#define RF_TEN_AC_ATEST_DAC_EN                                (1 << 4)
#define RF_TEN_AC_ATEST_OP_CC_MASK                            (0x0f)

