e-yes/nuttx/arch/risc-v/src/bl702/hardware/bl702_rf.h
#define RF_CIP_VG13_SEL_SHIFT                                 (2)
#define RF_CIP_VG13_SEL_MASK                                  (0x03 << RF_CIP_VG13_SEL_SHIFT)
#define RF_CIP_VG11_SEL_MASK                                  (0x03)

#define RF_PA1_PA_ATT_GC_SHIFT                                (28)
#define RF_PA1_PA_ATT_GC_MASK                                 (0x0f << RF_PA1_PA_ATT_GC_SHIFT)
#define RF_PA1_PA_PWRMX_BM_SHIFT                              (24)
#define RF_PA1_PA_PWRMX_BM_MASK                               (0x07 << RF_PA1_PA_PWRMX_BM_SHIFT)
#define RF_PA1_PA_PWRMX_DAC_PN_SWITCH                         (1 << 22)
#define RF_PA1_PA_PWRMX_OSDAC_SHIFT                           (18)
#define RF_PA1_PA_PWRMX_OSDAC_MASK                            (0x0f << RF_PA1_PA_PWRMX_OSDAC_SHIFT)
#define RF_PA1_PA_LZ_BIAS_EN                                  (1 << 17)
#define RF_PA1_PA_IB_FIX                                      (1 << 16)
#define RF_PA1_PA_HALF_ON                                     (1 << 15)
#define RF_PA1_PA_VBCAS_SHIFT                                 (12)
#define RF_PA1_PA_VBCAS_MASK                                  (0x07 << RF_PA1_PA_VBCAS_SHIFT)
#define RF_PA1_PA_VBCORE_SHIFT                                (8)
#define RF_PA1_PA_VBCORE_MASK                                 (0x0f << RF_PA1_PA_VBCORE_SHIFT)
#define RF_PA1_PA_IET_SHIFT                                   (4)
#define RF_PA1_PA_IET_MASK                                    (0x0f << RF_PA1_PA_IET_SHIFT)
#define RF_PA1_PA_ETB_EN                                      (1 << 3)
#define RF_PA1_PA_IAQ_MASK                                    (0x07)

#define RF_PA2_PA_IB_FIX_HW                                   (1 << 17)
#define RF_PA2_PA_HALF_ON_HW                                  (1 << 16)
#define RF_PA2_PA_VBCAS_HW_SHIFT                              (12)
#define RF_PA2_PA_VBCAS_HW_MASK                               (0x07 << RF_PA2_PA_VBCAS_HW_SHIFT)
#define RF_PA2_PA_VBCORE_HW_SHIFT                             (8)
#define RF_PA2_PA_VBCORE_HW_MASK                              (0x0f << RF_PA2_PA_VBCORE_HW_SHIFT)
#define RF_PA2_PA_IET_HW_SHIFT                                (4)
#define RF_PA2_PA_IET_HW_MASK                                 (0x0f << RF_PA2_PA_IET_HW_SHIFT)
#define RF_PA2_PA_ETB_EN_HW                                   (1 << 3)

#define RF_TMX_TX_TSENSE_EN                                   (1 << 16)
#define RF_TMX_TMX_BM_CAS_BULK_SHIFT                          (12)
#define RF_TMX_TMX_BM_CAS_BULK_MASK                           (0x07 << RF_TMX_TMX_BM_CAS_BULK_SHIFT)
#define RF_TMX_TMX_BM_CAS_SHIFT                               (8)
#define RF_TMX_TMX_BM_CAS_MASK                                (0x07 << RF_TMX_TMX_BM_CAS_SHIFT)
#define RF_TMX_TMX_BM_SW_SHIFT                                (4)
#define RF_TMX_TMX_BM_SW_MASK                                 (0x07 << RF_TMX_TMX_BM_SW_SHIFT)
#define RF_TMX_TMX_CS_MASK                                    (0x07)

#define RF_TBB_TOSDAC_I_SHIFT                                 (24)
#define RF_TBB_TOSDAC_I_MASK                                  (0x3f << RF_TBB_TOSDAC_I_SHIFT)
#define RF_TBB_TOSDAC_Q_SHIFT                                 (16)
#define RF_TBB_TOSDAC_Q_MASK                                  (0x3f << RF_TBB_TOSDAC_Q_SHIFT)
#define RF_TBB_ATEST_OUT_EN                                   (1 << 15)
#define RF_TBB_IQ_BIAS_SHORT                                  (1 << 14)
#define RF_TBB_CFLT_SHIFT                                     (12)
#define RF_TBB_CFLT_MASK                                      (0x03 << RF_TBB_CFLT_SHIFT)
#define RF_TBB_VCM_SHIFT                                      (8)
#define RF_TBB_VCM_MASK                                       (0x03 << RF_TBB_VCM_SHIFT)
#define RF_TBB_BM_CG_SHIFT                                    (4)
#define RF_TBB_BM_CG_MASK                                     (0x03 << RF_TBB_BM_CG_SHIFT)
#define RF_TBB_BM_SF_MASK                                     (0x03)

#define RF_LNA_LG_GSEL_SHIFT                                  (24)
#define RF_LNA_LG_GSEL_MASK                                   (0x07 << RF_LNA_LG_GSEL_SHIFT)
#define RF_LNA_CAP_LG_SHIFT                                   (20)
#define RF_LNA_CAP_LG_MASK                                    (0x03 << RF_LNA_CAP_LG_SHIFT)
#define RF_LNA_RFB_MATCH_SHIFT                                (16)
#define RF_LNA_RFB_MATCH_MASK                                 (0x07 << RF_LNA_RFB_MATCH_SHIFT)
#define RF_LNA_LOAD_CSW_HW_SHIFT                              (12)
#define RF_LNA_LOAD_CSW_HW_MASK                               (0x0f << RF_LNA_LOAD_CSW_HW_SHIFT)
#define RF_LNA_LOAD_CSW_SHIFT                                 (8)
#define RF_LNA_LOAD_CSW_MASK                                  (0x0f << RF_LNA_LOAD_CSW_SHIFT)
#define RF_LNA_BM_HW_SHIFT                                    (4)
#define RF_LNA_BM_HW_MASK                                     (0x0f << RF_LNA_BM_HW_SHIFT)
#define RF_LNA_BM_MASK                                        (0x0f)

#define RF_RMXGM_RMXGM_10M_MODE_EN                            (1 << 8)
#define RF_RMXGM_RMXGM_BM_SHIFT                               (4)
#define RF_RMXGM_RMXGM_BM_MASK                                (0x07 << RF_RMXGM_RMXGM_BM_SHIFT)
#define RF_RMXGM_RMX_BM_MASK                                  (0x07)

#define RF_RBB1_ROSDAC_RANGE                                  (1 << 31)
#define RF_RBB1_ROSDAC_I_HW_SHIFT                             (24)
#define RF_RBB1_ROSDAC_I_HW_MASK                              (0x3f << RF_RBB1_ROSDAC_I_HW_SHIFT)
#define RF_RBB1_ROSDAC_Q_HW_SHIFT                             (16)
#define RF_RBB1_ROSDAC_Q_HW_MASK                              (0x3f << RF_RBB1_ROSDAC_Q_HW_SHIFT)
#define RF_RBB1_ROSDAC_I_SHIFT                                (8)
#define RF_RBB1_ROSDAC_I_MASK                                 (0x3f << RF_RBB1_ROSDAC_I_SHIFT)
#define RF_RBB1_ROSDAC_Q_MASK                                 (0x3f)

#define RF_RBB2_RBB_CAP1_FC_I_SHIFT                           (24)
#define RF_RBB2_RBB_CAP1_FC_I_MASK                            (0x3f << RF_RBB2_RBB_CAP1_FC_I_SHIFT)
#define RF_RBB2_RBB_CAP1_FC_Q_SHIFT                           (16)
#define RF_RBB2_RBB_CAP1_FC_Q_MASK                            (0x3f << RF_RBB2_RBB_CAP1_FC_Q_SHIFT)
#define RF_RBB2_RBB_CAP2_FC_I_SHIFT                           (8)
#define RF_RBB2_RBB_CAP2_FC_I_MASK                            (0x3f << RF_RBB2_RBB_CAP2_FC_I_SHIFT)
#define RF_RBB2_RBB_CAP2_FC_Q_MASK                            (0x3f)

#define RF_RBB3_PWR_DET_EN                                    (1 << 31)
#define RF_RBB3_RXIQCAL_EN                                    (1 << 28)
#define RF_RBB3_RBB_BW_SHIFT                                  (24)
#define RF_RBB3_RBB_BW_MASK                                   (0x03 << RF_RBB3_RBB_BW_SHIFT)
#define RF_RBB3_RBB_TIA_IQBIAS_SHORT                          (1 << 21)
#define RF_RBB3_RBB_BQ_IQBIAS_SHORT                           (1 << 20)
#define RF_RBB3_RBB_VCM_SHIFT                                 (16)
#define RF_RBB3_RBB_VCM_MASK                                  (0x03 << RF_RBB3_RBB_VCM_SHIFT)
#define RF_RBB3_RBB_BM_OP_SHIFT                               (12)
#define RF_RBB3_RBB_BM_OP_MASK                                (0x07 << RF_RBB3_RBB_BM_OP_SHIFT)
#define RF_RBB3_RBB_DEQ_SHIFT                                 (8)
#define RF_RBB3_RBB_DEQ_MASK                                  (0x03 << RF_RBB3_RBB_DEQ_SHIFT)
#define RF_RBB3_RBB_BT_FIF_TUNE_SHIFT                         (5)
#define RF_RBB3_RBB_BT_FIF_TUNE_MASK                          (0x03 << RF_RBB3_RBB_BT_FIF_TUNE_SHIFT)
#define RF_RBB3_RBB_BT_MODE                                   (1 << 4)
#define RF_RBB3_RBB_BT_MODE_HW                                (1 << 0)

