e-yes/nuttx/arch/risc-v/src/bl702/hardware/bl702_rf.h
#define RF_PA_REG_CTRL_HW2_PA_VBCAS_11B_SHIFT                 (20)
#define RF_PA_REG_CTRL_HW2_PA_VBCAS_11B_MASK                  (0x07 << RF_PA_REG_CTRL_HW2_PA_VBCAS_11B_SHIFT)
#define RF_PA_REG_CTRL_HW2_PA_VBCORE_11B_SHIFT                (16)
#define RF_PA_REG_CTRL_HW2_PA_VBCORE_11B_MASK                 (0x0f << RF_PA_REG_CTRL_HW2_PA_VBCORE_11B_SHIFT)
#define RF_PA_REG_CTRL_HW2_PA_IET_11B_SHIFT                   (12)
#define RF_PA_REG_CTRL_HW2_PA_IET_11B_MASK                    (0x0f << RF_PA_REG_CTRL_HW2_PA_IET_11B_SHIFT)
#define RF_PA_REG_CTRL_HW2_PA_VBCAS_11G_SHIFT                 (8)
#define RF_PA_REG_CTRL_HW2_PA_VBCAS_11G_MASK                  (0x07 << RF_PA_REG_CTRL_HW2_PA_VBCAS_11G_SHIFT)
#define RF_PA_REG_CTRL_HW2_PA_VBCORE_11G_SHIFT                (4)
#define RF_PA_REG_CTRL_HW2_PA_VBCORE_11G_MASK                 (0x0f << RF_PA_REG_CTRL_HW2_PA_VBCORE_11G_SHIFT)
#define RF_PA_REG_CTRL_HW2_PA_IET_11G_MASK                    (0x0f)

#define RF_PA_REG_WIFI_CTRL_HW_PA_IB_FIX_WIFI                 (1 << 16)
#define RF_PA_REG_WIFI_CTRL_HW_PA_ETB_EN_WIFI                 (1 << 8)
#define RF_PA_REG_WIFI_CTRL_HW_PA_HALF_ON_WIFI                (1 << 0)

#define RF_ADDA_REG_CTRL_HW_ADDA_LDO_DVDD_SEL_TX_SHIFT        (4)
#define RF_ADDA_REG_CTRL_HW_ADDA_LDO_DVDD_SEL_TX_MASK         (0x07 << RF_ADDA_REG_CTRL_HW_ADDA_LDO_DVDD_SEL_TX_SHIFT)
#define RF_ADDA_REG_CTRL_HW_ADDA_LDO_DVDD_SEL_RX_MASK         (0x07)

#define RF_LO_REG_CTRL_HW1_LO_LF_R4_TX_SHIFT                  (24)
#define RF_LO_REG_CTRL_HW1_LO_LF_R4_TX_MASK                   (0x03 << RF_LO_REG_CTRL_HW1_LO_LF_R4_TX_SHIFT)
#define RF_LO_REG_CTRL_HW1_LO_LF_R4_RX_SHIFT                  (20)
#define RF_LO_REG_CTRL_HW1_LO_LF_R4_RX_MASK                   (0x03 << RF_LO_REG_CTRL_HW1_LO_LF_R4_RX_SHIFT)
#define RF_LO_REG_CTRL_HW1_LO_LF_RZ_TX_SHIFT                  (16)
#define RF_LO_REG_CTRL_HW1_LO_LF_RZ_TX_MASK                   (0x03 << RF_LO_REG_CTRL_HW1_LO_LF_RZ_TX_SHIFT)
#define RF_LO_REG_CTRL_HW1_LO_LF_RZ_RX_SHIFT                  (12)
#define RF_LO_REG_CTRL_HW1_LO_LF_RZ_RX_MASK                   (0x03 << RF_LO_REG_CTRL_HW1_LO_LF_RZ_RX_SHIFT)
#define RF_LO_REG_CTRL_HW1_LO_LF_CZ_TX_SHIFT                  (8)
#define RF_LO_REG_CTRL_HW1_LO_LF_CZ_TX_MASK                   (0x03 << RF_LO_REG_CTRL_HW1_LO_LF_CZ_TX_SHIFT)
#define RF_LO_REG_CTRL_HW1_LO_LF_CZ_RX_SHIFT                  (4)
#define RF_LO_REG_CTRL_HW1_LO_LF_CZ_RX_MASK                   (0x03 << RF_LO_REG_CTRL_HW1_LO_LF_CZ_RX_SHIFT)
#define RF_LO_REG_CTRL_HW1_LO_CP_SEL_TX                       (1 << 3)
#define RF_LO_REG_CTRL_HW1_LO_CP_SEL_RX                       (1 << 2)
#define RF_LO_REG_CTRL_HW1_LO_FBDV_HALFSTEP_EN_TX             (1 << 1)
#define RF_LO_REG_CTRL_HW1_LO_FBDV_HALFSTEP_EN_RX             (1 << 0)

#define RF_LO_CAL_CTRL_HW1_LO_VCO_FREQ_CW_2408_SHIFT          (24)
#define RF_LO_CAL_CTRL_HW1_LO_VCO_FREQ_CW_2408_MASK           (0xff << RF_LO_CAL_CTRL_HW1_LO_VCO_FREQ_CW_2408_SHIFT)
#define RF_LO_CAL_CTRL_HW1_LO_VCO_IDAC_CW_2408_SHIFT          (16)
#define RF_LO_CAL_CTRL_HW1_LO_VCO_IDAC_CW_2408_MASK           (0x1f << RF_LO_CAL_CTRL_HW1_LO_VCO_IDAC_CW_2408_SHIFT)
#define RF_LO_CAL_CTRL_HW1_LO_VCO_FREQ_CW_2404_SHIFT          (8)
#define RF_LO_CAL_CTRL_HW1_LO_VCO_FREQ_CW_2404_MASK           (0xff << RF_LO_CAL_CTRL_HW1_LO_VCO_FREQ_CW_2404_SHIFT)
#define RF_LO_CAL_CTRL_HW1_LO_VCO_IDAC_CW_2404_MASK           (0x1f)

#define RF_LO_CAL_CTRL_HW2_LO_VCO_FREQ_CW_2416_SHIFT          (24)
#define RF_LO_CAL_CTRL_HW2_LO_VCO_FREQ_CW_2416_MASK           (0xff << RF_LO_CAL_CTRL_HW2_LO_VCO_FREQ_CW_2416_SHIFT)
#define RF_LO_CAL_CTRL_HW2_LO_VCO_IDAC_CW_2416_SHIFT          (16)
#define RF_LO_CAL_CTRL_HW2_LO_VCO_IDAC_CW_2416_MASK           (0x1f << RF_LO_CAL_CTRL_HW2_LO_VCO_IDAC_CW_2416_SHIFT)
#define RF_LO_CAL_CTRL_HW2_LO_VCO_FREQ_CW_2412_SHIFT          (8)
#define RF_LO_CAL_CTRL_HW2_LO_VCO_FREQ_CW_2412_MASK           (0xff << RF_LO_CAL_CTRL_HW2_LO_VCO_FREQ_CW_2412_SHIFT)
#define RF_LO_CAL_CTRL_HW2_LO_VCO_IDAC_CW_2412_MASK           (0x1f)

#define RF_LO_CAL_CTRL_HW3_LO_VCO_FREQ_CW_2424_SHIFT          (24)
#define RF_LO_CAL_CTRL_HW3_LO_VCO_FREQ_CW_2424_MASK           (0xff << RF_LO_CAL_CTRL_HW3_LO_VCO_FREQ_CW_2424_SHIFT)
#define RF_LO_CAL_CTRL_HW3_LO_VCO_IDAC_CW_2424_SHIFT          (16)
#define RF_LO_CAL_CTRL_HW3_LO_VCO_IDAC_CW_2424_MASK           (0x1f << RF_LO_CAL_CTRL_HW3_LO_VCO_IDAC_CW_2424_SHIFT)
#define RF_LO_CAL_CTRL_HW3_LO_VCO_FREQ_CW_2420_SHIFT          (8)
#define RF_LO_CAL_CTRL_HW3_LO_VCO_FREQ_CW_2420_MASK           (0xff << RF_LO_CAL_CTRL_HW3_LO_VCO_FREQ_CW_2420_SHIFT)
#define RF_LO_CAL_CTRL_HW3_LO_VCO_IDAC_CW_2420_MASK           (0x1f)

#define RF_LO_CAL_CTRL_HW4_LO_VCO_FREQ_CW_2432_SHIFT          (24)
#define RF_LO_CAL_CTRL_HW4_LO_VCO_FREQ_CW_2432_MASK           (0xff << RF_LO_CAL_CTRL_HW4_LO_VCO_FREQ_CW_2432_SHIFT)
#define RF_LO_CAL_CTRL_HW4_LO_VCO_IDAC_CW_2432_SHIFT          (16)
#define RF_LO_CAL_CTRL_HW4_LO_VCO_IDAC_CW_2432_MASK           (0x1f << RF_LO_CAL_CTRL_HW4_LO_VCO_IDAC_CW_2432_SHIFT)
#define RF_LO_CAL_CTRL_HW4_LO_VCO_FREQ_CW_2428_SHIFT          (8)
#define RF_LO_CAL_CTRL_HW4_LO_VCO_FREQ_CW_2428_MASK           (0xff << RF_LO_CAL_CTRL_HW4_LO_VCO_FREQ_CW_2428_SHIFT)
#define RF_LO_CAL_CTRL_HW4_LO_VCO_IDAC_CW_2428_MASK           (0x1f)

#define RF_LO_CAL_CTRL_HW5_LO_VCO_FREQ_CW_2440_SHIFT          (24)
#define RF_LO_CAL_CTRL_HW5_LO_VCO_FREQ_CW_2440_MASK           (0xff << RF_LO_CAL_CTRL_HW5_LO_VCO_FREQ_CW_2440_SHIFT)
#define RF_LO_CAL_CTRL_HW5_LO_VCO_IDAC_CW_2440_SHIFT          (16)
#define RF_LO_CAL_CTRL_HW5_LO_VCO_IDAC_CW_2440_MASK           (0x1f << RF_LO_CAL_CTRL_HW5_LO_VCO_IDAC_CW_2440_SHIFT)
#define RF_LO_CAL_CTRL_HW5_LO_VCO_FREQ_CW_2436_SHIFT          (8)
#define RF_LO_CAL_CTRL_HW5_LO_VCO_FREQ_CW_2436_MASK           (0xff << RF_LO_CAL_CTRL_HW5_LO_VCO_FREQ_CW_2436_SHIFT)
#define RF_LO_CAL_CTRL_HW5_LO_VCO_IDAC_CW_2436_MASK           (0x1f)

#define RF_LO_CAL_CTRL_HW6_LO_VCO_FREQ_CW_2448_SHIFT          (24)
#define RF_LO_CAL_CTRL_HW6_LO_VCO_FREQ_CW_2448_MASK           (0xff << RF_LO_CAL_CTRL_HW6_LO_VCO_FREQ_CW_2448_SHIFT)
#define RF_LO_CAL_CTRL_HW6_LO_VCO_IDAC_CW_2448_SHIFT          (16)
#define RF_LO_CAL_CTRL_HW6_LO_VCO_IDAC_CW_2448_MASK           (0x1f << RF_LO_CAL_CTRL_HW6_LO_VCO_IDAC_CW_2448_SHIFT)
#define RF_LO_CAL_CTRL_HW6_LO_VCO_FREQ_CW_2444_SHIFT          (8)
#define RF_LO_CAL_CTRL_HW6_LO_VCO_FREQ_CW_2444_MASK           (0xff << RF_LO_CAL_CTRL_HW6_LO_VCO_FREQ_CW_2444_SHIFT)
#define RF_LO_CAL_CTRL_HW6_LO_VCO_IDAC_CW_2444_MASK           (0x1f)

#define RF_LO_CAL_CTRL_HW7_LO_VCO_FREQ_CW_2456_SHIFT          (24)
#define RF_LO_CAL_CTRL_HW7_LO_VCO_FREQ_CW_2456_MASK           (0xff << RF_LO_CAL_CTRL_HW7_LO_VCO_FREQ_CW_2456_SHIFT)
#define RF_LO_CAL_CTRL_HW7_LO_VCO_IDAC_CW_2456_SHIFT          (16)
#define RF_LO_CAL_CTRL_HW7_LO_VCO_IDAC_CW_2456_MASK           (0x1f << RF_LO_CAL_CTRL_HW7_LO_VCO_IDAC_CW_2456_SHIFT)
#define RF_LO_CAL_CTRL_HW7_LO_VCO_FREQ_CW_2452_SHIFT          (8)
#define RF_LO_CAL_CTRL_HW7_LO_VCO_FREQ_CW_2452_MASK           (0xff << RF_LO_CAL_CTRL_HW7_LO_VCO_FREQ_CW_2452_SHIFT)
#define RF_LO_CAL_CTRL_HW7_LO_VCO_IDAC_CW_2452_MASK           (0x1f)

